/**
  ******************************************************************************
  * @copyright	:
  * @file		        : DataLoad.h
  * @brief	        :
  * @version	    :  V1.0.0
  * @author       :  Huayu.Hu
  * @date		    :  2020.04.25
  ******************************************************************************
  * @history	    :
  ******************************************************************************
  */

#ifndef _DATA_LOAD_H
#define _DATA_LOAD_H

#include "dqu_dfs_common/dfsDataRead.h"


  /*************************************************************************
  *函数功能：读取二进制文件到内存dataBuf[]该函数是由于公共查询函数不满足
  *使用增加的临时函数，待公共函数增加该功能后去掉----ryj
  *参数说明：dataName文件存储的FLASH地址
  *		   Lengths读取文件的总长度
  *		   *pDataBuf数据在内存中存储的数组地址
  *		   ReadLength单次读取数据的长度
  *		   ReadMode读取方式1:一次性读取数据文件;2:拆分成多次读取
  *		   dfsDH 定义一个文件头,包含了数据头,数据索引各信息
  *返回值： 0失败，1成功,2单帧读取成功;
  **************************************************************************/
UINT8 dataReadTemp(CHAR *dataName, DQU_READ_DATA_STOR_STRU *FsStorStu);


#endif  /*_DATA_LOAD_H*/